#include <iostream>
using namespace std;

int main() {
    float x = 0.2, y = 4;
    float results[6];

    for (int i = 0; i < 6; i++) {
        float Y = 0;

        // Вставка асемблерного коду
        _asm {
            finit;                 // Ініціалізуємо FPU
            fld x;                 // Завантажуємо значення x у FPU
            fmul ST, ST;           // Множимо x на себе (x^2)
            fld1;                  // Завантажуємо 1 у FPU
            fadd;                  // Додаємо 1 до x^2
            fld y;                 // Завантажуємо значення y у FPU
            fyl2x;                 // Обчислюємо y * log2(x)
            fld st(0);             // Копіюємо значення з верхнього регістра в новий
            frndint;               // Округляємо значення до найближчого цілого
            fxch st(1);            // Міняємо місцями верхній і другий регістри
            fsub st(0), st(1);     // Віднімаємо значення в верхньому регістрі від другого
            f2xm1;                 // Обчислюємо 2^x - 1
            fld1;                  // Завантажуємо 1 у FPU
            faddp st(1), st;       // Додаємо 1 до значення з другого регістра
            fscale;                // Масштабуємо значення (2^x)
            fstp Y;                // Зберігаємо результат у Y
        }

        results[i] = Y;
        x += 0.4;  
    }

    for (int i = 0; i < 6; i++) {
        cout << "Y[" << i + 1 << "] = " << results[i] << endl;
    }
    return 0;
}
